
  <details>
  <summary>Click to expand</summary>

  ```terraform
  module.lambda.data.archive_file.token_refresh: Reading...
module.lambda.data.archive_file.token_refresh: Read complete after 0s [id=0a5ee18200d6ef0f79a444d2e6b317a84ea4c7ca]
module.ecr.aws_ecr_repository.microservices["kubestock/ms-inventory"]: Refreshing state... [id=kubestock/ms-inventory]
module.ecr.aws_ecr_repository.microservices["kubestock/web"]: Refreshing state... [id=kubestock/web]
module.cicd.data.aws_iam_openid_connect_provider.github_actions: Reading...
module.compute.data.aws_ami.ubuntu: Reading...
module.lambda.aws_cloudwatch_event_rule.token_refresh_schedule: Refreshing state... [id=kubestock-token-refresh-schedule]
module.ecr.aws_ecr_repository.microservices["kubestock/ms-identity"]: Refreshing state... [id=kubestock/ms-identity]
module.ecr.aws_ecr_repository.microservices["kubestock/ms-supplier"]: Refreshing state... [id=kubestock/ms-supplier]
module.secrets.aws_iam_user.external_secrets: Refreshing state... [id=kubestock-external-secrets]
module.lambda.aws_iam_role.token_refresh: Refreshing state... [id=kubestock-token-refresh-lambda-role]
module.kubernetes.aws_iam_role.k8s_nodes: Refreshing state... [id=kubestock-node-role]
module.compute.aws_key_pair.main: Refreshing state... [id=kubestock-key]
module.cicd.data.aws_iam_openid_connect_provider.github_actions: Read complete after 1s [id=arn:aws:iam::478468757808:oidc-provider/token.actions.githubusercontent.com]
module.ecr.aws_ecr_repository.microservices["kubestock/ms-order-management"]: Refreshing state... [id=kubestock/ms-order-management]
module.ecr.aws_ecr_repository.microservices["kubestock/ms-product"]: Refreshing state... [id=kubestock/ms-product]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-south-1]
module.secrets.aws_secretsmanager_secret.asgardeo["production"]: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:478468757808:secret:kubestock/production/asgardeo-TaqYrp]
module.rds.aws_db_parameter_group.postgres: Refreshing state... [id=kubestock-postgres-params]
module.secrets.aws_secretsmanager_secret.asgardeo["staging"]: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:478468757808:secret:kubestock/staging/asgardeo-wcyunr]
module.kubernetes.aws_iam_policy.k8s_controllers: Refreshing state... [id=arn:aws:iam::478468757808:policy/kubestock-k8s-controllers-policy]
data.aws_caller_identity.current: Reading...
module.compute.data.aws_ami.ubuntu: Read complete after 2s [id=ami-0ade68f094cc81635]
module.networking.aws_vpc.main: Refreshing state... [id=vpc-0a65a6bd6be2223dc]
module.kubernetes.aws_iam_policy.k8s_ecr_pull: Refreshing state... [id=arn:aws:iam::478468757808:policy/kubestock-k8s-ecr-pull]
module.secrets.aws_secretsmanager_secret.db["production"]: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:478468757808:secret:kubestock/production/db-P877dp]
module.secrets.aws_secretsmanager_secret.db["staging"]: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:478468757808:secret:kubestock/staging/db-TaqYrp]
module.secrets.aws_iam_access_key.external_secrets: Refreshing state... [id=AKIAW6ZXV3EYOXZTGH2U]
module.cicd.aws_iam_role.github_actions_ecr: Refreshing state... [id=KubeStock-github-actions-ecr-role]
module.lambda.aws_lambda_function.token_refresh: Refreshing state... [id=kubestock-refresh-join-token]
module.kubernetes.aws_iam_role_policy_attachment.k8s_nodes_ssm: Refreshing state... [id=kubestock-node-role-20251122171458069900000001]
data.aws_caller_identity.current: Read complete after 0s [id=478468757808]
module.kubernetes.aws_iam_instance_profile.k8s_nodes: Refreshing state... [id=kubestock-node-profile]
module.kubernetes.aws_iam_role_policy_attachment.k8s_controllers: Refreshing state... [id=kubestock-node-role-20251122171458070500000002]
module.kubernetes.aws_iam_role_policy_attachment.k8s_ecr_pull: Refreshing state... [id=kubestock-node-role-20251206093956675200000001]
module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock/web"]: Refreshing state... [id=kubestock/web]
module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock/ms-inventory"]: Refreshing state... [id=kubestock/ms-inventory]
module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock/ms-order-management"]: Refreshing state... [id=kubestock/ms-order-management]
module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock/ms-identity"]: Refreshing state... [id=kubestock/ms-identity]
module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock/ms-product"]: Refreshing state... [id=kubestock/ms-product]
module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock/ms-supplier"]: Refreshing state... [id=kubestock/ms-supplier]
module.secrets.aws_iam_policy.external_secrets_read: Refreshing state... [id=arn:aws:iam::478468757808:policy/kubestock-external-secrets-read]
module.kubernetes.aws_iam_policy.k8s_external_secrets: Refreshing state... [id=arn:aws:iam::478468757808:policy/kubestock-k8s-external-secrets-policy]
module.kubernetes.aws_iam_role_policy.k8s_nodes_ssm_params: Refreshing state... [id=kubestock-node-role:k8s-nodes-ssm-policy]
module.lambda.aws_iam_policy.token_refresh: Refreshing state... [id=arn:aws:iam::478468757808:policy/kubestock-token-refresh-lambda-policy]
module.secrets.aws_iam_user_policy_attachment.external_secrets_read: Refreshing state... [id=kubestock-external-secrets-20251206100114287600000001]
module.cicd.aws_iam_policy.github_actions_ecr: Refreshing state... [id=arn:aws:iam::478468757808:policy/KubeStock-github-actions-ecr-policy]
module.kubernetes.aws_iam_role_policy_attachment.k8s_external_secrets: Refreshing state... [id=kubestock-node-role-20251206092316623400000001]
module.lambda.aws_iam_role_policy_attachment.token_refresh: Refreshing state... [id=kubestock-token-refresh-lambda-role-20251130171832420000000001]
module.cicd.aws_iam_role_policy_attachment.github_actions_ecr: Refreshing state... [id=KubeStock-github-actions-ecr-role-20251125155745016000000001]
module.lambda.aws_lambda_permission.allow_eventbridge: Refreshing state... [id=AllowEventBridgeInvoke]
module.lambda.aws_cloudwatch_log_group.token_refresh: Refreshing state... [id=/aws/lambda/kubestock-refresh-join-token]
module.lambda.aws_cloudwatch_event_target.token_refresh: Refreshing state... [id=kubestock-token-refresh-schedule-RefreshKubeToken]
module.networking.aws_subnet.public[1]: Refreshing state... [id=subnet-0559dfc1c9f2ba26d]
module.networking.aws_subnet.private[1]: Refreshing state... [id=subnet-0537648f14b08fae9]
module.networking.aws_subnet.private[2]: Refreshing state... [id=subnet-0780d8e640722a270]
module.networking.aws_subnet.public[0]: Refreshing state... [id=subnet-01240ef2e0b751289]
module.networking.aws_internet_gateway.main: Refreshing state... [id=igw-01f445518c285bb47]
module.networking.aws_subnet.public[2]: Refreshing state... [id=subnet-0577be992dc0ab111]
module.security.aws_security_group.dev_server: Refreshing state... [id=sg-0d67ff044a38749c1]
module.networking.aws_subnet.private[0]: Refreshing state... [id=subnet-0b1dc7ca3ea5b0331]
module.kubernetes.aws_lb_target_group.staging_frontend_https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-staging-fe-https/5ac6bfd0c138857e]
module.kubernetes.aws_lb_target_group.staging_frontend_http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-staging-fe-http/9b9014270a03e31e]
module.kubernetes.aws_lb_target_group.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-k8s-api-tg/0247a93887c9714b]
module.security.aws_security_group.k8s_common: Refreshing state... [id=sg-0b067e3fb603b11be]
module.security.aws_security_group.bastion: Refreshing state... [id=sg-0b8af5ccdc9c1d59a]
module.kubernetes.aws_lb_target_group.argocd_ui: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-argocd-ui/38727bd4aa6b3485]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-05c13f4e14ae0919a]
module.networking.aws_eip.nat: Refreshing state... [id=eipalloc-0343d1d2c3192b117]
module.rds.aws_db_subnet_group.main: Refreshing state... [id=kubestock-db-subnet-group]
module.compute.aws_instance.dev_server: Refreshing state... [id=i-0924600f3a846a813]
module.security.aws_security_group.workers: Refreshing state... [id=sg-08b85cb7308f90c2f]
module.security.aws_security_group.nlb_api: Refreshing state... [id=sg-0a439eecb4c77e2c3]
module.compute.aws_instance.bastion: Refreshing state... [id=i-0279c79ec12f9626b]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-032368bbbbdbffa70]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0382b6c798e2559df]
module.networking.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-072cb499e6ec152fc]
module.security.aws_security_group.control_plane: Refreshing state... [id=sg-0ac3836e0f42135fb]
module.networking.aws_nat_gateway.main: Refreshing state... [id=nat-054ea26583c09fb63]
module.kubernetes.aws_launch_template.k8s_worker: Refreshing state... [id=lt-01159ecec1ce86876]
module.kubernetes.aws_lb.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:loadbalancer/net/kubestock-nlb/e316550036e3d7d8]
module.security.aws_security_group.rds: Refreshing state... [id=sg-0beb81e7082e092e4]
module.kubernetes.aws_instance.control_plane: Refreshing state... [id=i-08ff658102a4848d6]
module.networking.aws_route_table.private[2]: Refreshing state... [id=rtb-04b01b74ef23587e6]
module.networking.aws_route_table.private[0]: Refreshing state... [id=rtb-06f165d277305b4f2]
module.networking.aws_route_table.private[1]: Refreshing state... [id=rtb-0b5da2e36e8f81b57]
module.rds.aws_db_instance.production: Refreshing state... [id=db-BCZAHFE3G7WAETSZHTIH4JRG6M]
module.rds.aws_db_instance.staging: Refreshing state... [id=db-3X4DF5ESJAZVG6SGKJTFFOT2C4]
module.kubernetes.aws_autoscaling_group.k8s_workers: Refreshing state... [id=kubestock-workers-asg]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0899b49bc97142ad1]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05cd7e585640a44e2]
module.networking.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0861217d4449ff33d]
module.kubernetes.aws_lb_listener.staging_frontend_https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:listener/net/kubestock-nlb/e316550036e3d7d8/6e7e38ba56aa76de]
module.kubernetes.aws_lb_listener.argocd_ui: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:listener/net/kubestock-nlb/e316550036e3d7d8/16d41a2889481d6b]
module.kubernetes.aws_lb_listener.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:listener/net/kubestock-nlb/e316550036e3d7d8/49f9cbf2bf8629d1]
module.kubernetes.aws_lb_listener.staging_frontend_http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:listener/net/kubestock-nlb/e316550036e3d7d8/c702193e183e3ca6]
module.kubernetes.aws_autoscaling_attachment.staging_frontend_http: Refreshing state... [id=kubestock-workers-asg-20251206213236877200000001]
module.kubernetes.aws_autoscaling_attachment.argocd_ui: Refreshing state... [id=kubestock-workers-asg-20251206213236904600000002]
module.kubernetes.aws_autoscaling_attachment.staging_frontend_https: Refreshing state... [id=kubestock-workers-asg-20251206213237041100000003]
module.compute.aws_eip.dev_server: Refreshing state... [id=eipalloc-056c594e35c87a208]
module.compute.aws_eip.bastion: Refreshing state... [id=eipalloc-0e7b598a9492e3186]
module.kubernetes.aws_lb_target_group_attachment.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-k8s-api-tg/0247a93887c9714b-2025112217153294790000000a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.compute.aws_eip.bastion will be updated in-place
  ~ resource "aws_eip" "bastion" {
        id                       = "eipalloc-0e7b598a9492e3186"
      ~ instance                 = "i-0279c79ec12f9626b" -> (known after apply)
        tags                     = {
            "Name" = "kubestock-bastion-eip"
        }
        # (17 unchanged attributes hidden)
    }

  # module.compute.aws_eip.dev_server will be updated in-place
  ~ resource "aws_eip" "dev_server" {
        id                       = "eipalloc-056c594e35c87a208"
      ~ instance                 = "i-0924600f3a846a813" -> (known after apply)
        tags                     = {
            "Name" = "kubestock-dev-server-eip"
        }
        # (17 unchanged attributes hidden)
    }

  # module.compute.aws_instance.bastion must be replaced
-/+ resource "aws_instance" "bastion" {
      ~ arn                                  = "arn:aws:ec2:ap-south-1:478468757808:instance/i-0279c79ec12f9626b" -> (known after apply)
      ~ associate_public_ip_address          = true -> false # forces replacement
      ~ availability_zone                    = "ap-south-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0279c79ec12f9626b" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-02fb4e4d8486e3e70" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-172.ap-south-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.172" -> (known after apply)
      ~ public_dns                           = "ec2-13-202-52-3.ap-south-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "13.202.52.3" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "kubestock-bastion"
            "Role" = "bastion"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ tags_all              = {
              - "Environment" = "production"
              - "ManagedBy"   = "Terraform"
              - "Project"     = "KubeStock"
            } -> (known after apply)
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-00cf547d9a7c93d65" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.compute.aws_instance.dev_server must be replaced
-/+ resource "aws_instance" "dev_server" {
      ~ arn                                  = "arn:aws:ec2:ap-south-1:478468757808:instance/i-0924600f3a846a813" -> (known after apply)
      ~ associate_public_ip_address          = true -> false # forces replacement
      ~ availability_zone                    = "ap-south-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0924600f3a846a813" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0217230c5a7308188" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-139.ap-south-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.139" -> (known after apply)
      ~ public_dns                           = "ec2-3-7-164-184.ap-south-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "3.7.164.184" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "kubestock-dev-server"
            "Role" = "development"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "0a78962d6aa8e907c7fe8079e66e95a86773f3b9" -> "2186c6d5d7446ccda737796bb75d7f48bc8d2e0e"
      + user_data_base64                     = (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ tags_all              = {
              - "Environment" = "production"
              - "ManagedBy"   = "Terraform"
              - "Project"     = "KubeStock"
            } -> (known after apply)
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-0c0f1fe9f7ed0bec9" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.kubernetes.aws_launch_template.k8s_worker will be updated in-place
  ~ resource "aws_launch_template" "k8s_worker" {
        id                                   = "lt-01159ecec1ce86876"
      ~ latest_version                       = 9 -> (known after apply)
        name                                 = "kubestock-worker-20251130144326793000000001"
        tags                                 = {
            "Name" = "kubestock-worker-launch-template"
        }
      ~ user_data                            = "IyEvYmluL2Jhc2gNCnNldCAtZQ0KICAgIA0KZXhlYyA+ID4odGVlIC92YXIvbG9nL3VzZXItZGF0YS5sb2cpIDI+JjENCmVjaG8gIlN0YXJ0aW5nIHdvcmtlciBub2RlIGluaXRpYWxpemF0aW9uIGF0ICQoZGF0ZSkiDQogICAgDQpzbGVlcCAxMA0KICAgIA0KL3Vzci9sb2NhbC9iaW4vam9pbi1jbHVzdGVyLnNoIC0tc3NtDQogICAgDQplY2hvICJXb3JrZXIgbm9kZSBpbml0aWFsaXphdGlvbiBjb21wbGV0ZSBhdCAkKGRhdGUpIg0K" -> "IyEvYmluL2Jhc2gKc2V0IC1lCiAgICAKZXhlYyA+ID4odGVlIC92YXIvbG9nL3VzZXItZGF0YS5sb2cpIDI+JjEKZWNobyAiU3RhcnRpbmcgd29ya2VyIG5vZGUgaW5pdGlhbGl6YXRpb24gYXQgJChkYXRlKSIKICAgIApzbGVlcCAxMAogICAgCi91c3IvbG9jYWwvYmluL2pvaW4tY2x1c3Rlci5zaCAtLXNzbQogICAgCmVjaG8gIldvcmtlciBub2RlIGluaXRpYWxpemF0aW9uIGNvbXBsZXRlIGF0ICQoZGF0ZSkiCg=="
        # (16 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.token_refresh will be updated in-place
  ~ resource "aws_lambda_function" "token_refresh" {
        id                             = "kubestock-refresh-join-token"
      ~ last_modified                  = "2025-12-06T21:06:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "Foa22LXBsH1YQtNhT5qD7sUvQQc0on7JWd55ItJ0fVE=" -> "aIJSLgFJuFtGnUjPsmL9MuAHl8cVWCxpNYew8ugLa8U="
        tags                           = {
            "Name" = "kubestock-refresh-join-token"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 4 to change, 2 to destroy.

Changes to Outputs:
  ~ dev_server_instance_id             = "i-0924600f3a846a813" -> (known after apply)
  ~ dev_server_management              = {
      ~ get_ip = "aws ec2 describe-instances --instance-ids i-0924600f3a846a813 --query 'Reservations[0].Instances[0].PublicIpAddress' --output text" -> (known after apply)
      ~ start  = "aws ec2 start-instances --instance-ids i-0924600f3a846a813" -> (known after apply)
      ~ status = "aws ec2 describe-instances --instance-ids i-0924600f3a846a813 --query 'Reservations[0].Instances[0].State.Name' --output text" -> (known after apply)
      ~ stop   = "aws ec2 stop-instances --instance-ids i-0924600f3a846a813" -> (known after apply)
    }
  ~ dev_server_state                   = "running" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  ```

  </details>
        